############### Procedure
# Step 1: Run - sudo xcode-select --install (Installs Command Line Tools without Xcode)
# Step 2: Install Homebrew - /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# Step 3: Install brew bundle command - brew tap Homebrew/bundle
# Step 4: Create Brewfile - touch Brewfile (creates it in the home folder by default)
# Step 5: Copy Brewfile Contents into file - open -e Brewfile
# Step 6: Run Brewfile - brew bundle
###############

############### Install Brew Packages
brew 'bash-completion'
brew 'composer' 
brew 'elixir'
brew 'git'
brew 'go'
brew 'mas'
brew 'mysql'
brew 'node'
brew 'npm'
brew 'php'
brew 'postgresql@9.6'
brew 'python'
brew 'python3'
brew 'ruby'
###############

############### Install Casks https://caskroom.github.io/
cask '1password'
cask 'atom'
# cask 'battle-net' (Doesn't work. Never shows up in Applications)
# cask 'calibre'
# cask 'discord'
cask 'disk-inventory-x'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'keepassxc'
# cask 'mamp'
cask 'spectacle'
cask 'spotify'
cask 'slack'
cask 'steam'
# cask 'virtualbox'
cask 'visual-studio-code'
cask 'sublime-text'

############### Install Mac Applications from App Store
# mas 'Xcode', id: 497799835 (This installs the whole xcode ide)
#
###############


############### Cool Resources
# https://medium.com/@satorusasozaki/automate-mac-os-x-configuration-by-using-brewfile-58a78ce5cc53
# https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/
#
###############